/*******************************************************************************
 *
 *  МОДУЛЬ        : Inputs.h
 *
 *  Автор         : Л.Стасенко
 *  Дата начала   : 12.12.2014
 *  Версия        : 1.1
 *  Комментарии    : Обработка логических входов с антидребезгом
 *
 ******************************************************************************/
/*
  В режиме OSDP у ридера имеется два свободных входа (оранжевый, LED-G и
  коричневый, LED-R), которые могут использоваться как входы для RTE & DC.
*/


#ifndef INPUTS_DEF_H
#define INPUTS_DEF_H

/* Основные типы данных */
#include "Board.h"

/*******************************************************************************                                                             :
 *    Количество циклов опроса входов до фиксации 
 *    смены состояния по-умолчанию в квантах опроса:
 *******************************************************************************/
#define       DEFAULT_MAX_INP_COUNT     5


/*******************************************************************************                                                             :
 *    Перечислимый тип состояний входа без контроля шлейфа
 *******************************************************************************/
typedef enum {
  istNormal =  0,
  istActive,
} tInputStates;

// Определяем тип входа с антидребезгом:
typedef struct {
  uint8_t       MaxCount;               // Сколько тиков до изменения - конфигурим при старте
  uint8_t       Count;                  // Счетчик совпадений состояния
  tInputStates  OldState;               // Последнее стабильное состояние
  tInputStates  NewState;               // ... а на этом работаем с подсчетом
} tLogicInput;

/*******************************************************************************                                                             :
 *                       МАССИВ СТРУКТУР ЛОГИЧЕСКИХ ВХОДОВ
 *******************************************************************************/
extern volatile tLogicInput   Inputs[2];

// Распределяем функции входов:
#define   DC      Inputs[0]         // Дверной контакт
#define   RTE     Inputs[1]         // Кнопка запроса на выход

/*******************************************************************************                                                             :
 *                ФУНКЦИИ МОДУЛЯ ОБЩЕГО НАЗНАЧЕНИЯ
 *******************************************************************************/

//////////////////////////////////////////////////////////////////////////////////////
//  Function    : InitOsdpInputs
//  Description : Инициализация двух структур входов DC, RTE
//  Input       : None
//  Output      : None
//  Comments    : None
//////////////////////////////////////////////////////////////////////////////////////
extern void InitOsdpInputs(void);

//////////////////////////////////////////////////////////////////////////////////////
//  Function    : CheckOsdpInputs
//  Description : Вызывается по таймеру и проверяет дополнительные логические входы
//  Input       : None
//  Output      : None
//  Comments    : Проверяет состояние всех входов с формированием флагов изменения
//////////////////////////////////////////////////////////////////////////////////////
extern void CheckOsdpInputs(void);




#endif

/*----------------------------------------------------------------------------
 * end of file
 *---------------------------------------------------------------------------*/
